# YOLOv8n with MFDAM (Multi-scale Fusion Domain Adaptation Module)
# 专门用于Day→Rain域适应的YOLOv8模型配置

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
max_channels: 1024

# anchors
anchors: 3

# MFDAM配置
mfdam:
  enabled: true
  description: "多尺度融合域适应模块 - Day→Rain域适应"
  
  # 特征提取配置
  feature_extraction:
    extract_layers: [9, 15, 18, 21]  # backbone末端和head的多个层
    feature_dims: [1024, 256, 512, 1024]  # 对应层的特征维度
    fusion_dim: 256  # 融合后的特征维度
    
  # 域适应配置  
  domain_adaptation:
    hidden_dim: 128
    num_domains: 2  # source(day), target(rain)
    num_weather_types: 2  # day, rain
    grl_weight: 1.0  # 梯度反转层权重
    
  # 多尺度融合配置
  fusion_module:
    attention_type: "spatial"  # 注意力类型: spatial, channel, both
    fusion_strategy: "concat_conv"  # 融合策略
    residual_connection: true  # 残差连接

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9 <- MFDAM特征提取点

# YOLOv8.0n head with MFDAM integration
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat backbone P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 cat backbone P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small) <- MFDAM特征提取点

  - [-1, 1, Conv, [256, 3, 2]]  # 16
  - [[-1, 12], 1, Concat, [1]]  # 17 cat head P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium) <- MFDAM特征提取点

  - [-1, 1, Conv, [512, 3, 2]]  # 19
  - [[-1, 9], 1, Concat, [1]]   # 20 cat head P5
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large) <- MFDAM特征提取点

  - [[15, 18, 21], 1, Detect, [nc]]  # 22 Detect(P3, P4, P5)

# MFDAM训练配置
training:
  # 损失函数权重
  loss_weights:
    detection: 1.0        # 标准检测损失权重
    domain_adversarial: 1.2   # 域对抗损失权重  
    consistency: 0.6      # 一致性损失权重
    alignment: 0.4        # 特征对齐损失权重
    weather: 0.8          # 天气分类损失权重
    
  # 学习率配置
  learning_rates:
    backbone: 0.01        # 骨干网络学习率
    head: 0.01           # 检测头学习率
    domain_components: 0.0005  # 域适应组件学习率
    
  # 训练策略
  strategy:
    warmup_epochs: 5      # 预热轮数 (仅检测训练)
    da_start_epoch: 8     # 域适应开始轮数
    domain_balance: 0.6   # 域平衡比例 (0.6偏向目标域)
    
# 推理配置
inference:
  # 后处理参数
  conf_thres: 0.25      # 置信度阈值
  iou_thres: 0.45       # IoU阈值
  max_det: 300          # 最大检测数量
  
  # 雨天优化参数
  rain_adaptation:
    enabled: true
    visibility_compensation: true  # 能见度补偿
    contrast_enhancement: true     # 对比度增强
    
# 数据配置建议
data_requirements:
  source_domain:
    description: "白天晴朗天气条件"
    min_samples: 5000
    image_quality: "高质量，光照良好"
    
  target_domain:
    description: "雨天天气条件"
    min_samples: 3000
    weather_conditions: ["小雨", "中雨", "大雨"]
    unlabeled_ratio: 0.7  # 可使用70%无标签数据